<h1>Pandas DataFrame </h1>

In [1]:
import pandas as pd

#### ___Creating Pandas DataFrame___

In [2]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

#### ___Count NaN values in DataFrame___

In [38]:

x =  store_items.isnull()
print('Number of NaN values in our each column:\n', x)
print()

# We count the number of NaN values in each column
x =  store_items.isnull().sum()
print('Number of NaN values in our each column:\n', x)
print()

# We count the number of NaN values in the dataframe
x =  store_items.isnull().sum().sum()
print('\nNumber of NaN values in our DataFrame:', x)

Number of NaN values in our each column:
 bikes      False
pants      False
watches    False
shirts      True
shoes      False
suits       True
glasses     True
dtype: bool

Number of NaN values in our each column:
 bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64


Number of NaN values in our DataFrame: 3

####  ___Count the total non-NaN values___

In [10]:
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count())

Number of non-NaN values in the columns of our DataFrame:
 bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

#### ___Eliminating NaN Values___

In [11]:
store_items.dropna(axis = 0) #drop any row has a NAN

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [12]:
# We drop any columns with NaN values
store_items.dropna(axis = 1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

Notice that the **.dropna()** method eliminates (drops) the rows or columns with NaN values out of place. 

This means that the original DataFrame is not modified. You can always remove the desired rows or columns in place by setting the keyword ***inplace = True*** inside the dropna() function.

#### ___Substituting NaN Values___


- Replace: `dataframe.fillna(newvalue)`
- Using the fill methods: <font color='red'>"ffill" and "backfill" </font>    using `dataframe.fillna(method = 'ffill or backfill, axis = 0 or 1)`

- Using linear interpolation: `dataframe.interpolate(method = 'linear', axis)`
- <font color='red'>axis = 0</font>  implies across the column and <font color='red'>axis = 1</font>  implies across the rows

In [13]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [14]:
#method we will try forward-fill ffill
# We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [15]:
store_items.fillna(method = 'ffill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [16]:
# We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

###  ___Loading Data into a pandas DataFrame___

In [33]:
df = pd.read_csv('org_name.csv')

In [34]:
df.head()

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000

In [35]:
df.shape

(9, 5)

In [36]:
df.isnull().any()

Year          False
Name          False
Department    False
Age           False
Salary        False
dtype: bool

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        9 non-null      int64
 1   Name        9 non-null      object
 2   Department  9 non-null      object
 3   Age         9 non-null      int64
 4   Salary      9 non-null      int64
dtypes: int64(3), object(2)
memory usage: 488.0+ bytes

In [42]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,9.0,1991.000000,0.866025,1990.0,1990.0,1991.0,1992.0,1992.0
Age,9.0,32.222222,7.870479,25.0,27.0,30.0,32.0,46.0
Salary,9.0,54333.333333,5147.815070,48000.0,50000.0,52000.0,60000.0,62000.0

In [43]:
df['Salary'].describe()

count        9.000000
mean     54333.333333
std       5147.815070
min      48000.000000
25%      50000.000000
50%      52000.000000
75%      60000.000000
max      62000.000000
Name: Salary, dtype: float64

#### ___groupby() method___

In [45]:
# We display the mean age and salary per year

df.groupby(['Year']).apply('mean')

            Age   Salary
Year
1990  33.333333  51000.0
1991  34.333333  54000.0
1992  29.000000  58000.0

In [52]:
# We display the average salary per year
df.groupby(['Year'])['Salary'].mean()

Year
1990    51000.0
1991    54000.0
1992    58000.0
Name: Salary, dtype: float64

In [55]:
# We display the total amount of money spent in salaries each year
df.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [56]:
# We display the total amount of money spent in salaries each year
df.groupby(['Year']).agg({'Salary' : sum})

      Salary
Year
1990  153000
1991  162000
1992  174000

In [47]:
# We display the total salary each employee received in all the years they worked for the company
df.groupby(['Name'])['Salary'].sum()

Name
Alice      50000
Bob        48000
Charlie    55000
Dakota     52000
Elsa       50000
Frank      60000
Grace      60000
Hoffman    52000
Inaar      62000
Name: Salary, dtype: int64

In [48]:
# We display the salary distribution per department per year.
df.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64

      Salary
Year
1990  153000
1991  162000
1992  174000

In [31]:
import pandas as pd
import numpy as np

# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
#pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 
# The ratings given are in the range from 1 to 5, with 5 being the best score. 
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])


# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. 
# Let Pandas automatically assign numerical row indices to the DataFrame. 

# TO DO: Create a dictionary with the data given above
dat = {'Book Title' : books, 'Author' : authors,
       'User 1' : user_1, 'User 2' : user_2,
       'User 3' : user_3, 'User 4' : user_4}

# TO DO: Create a Pandas DataFrame using the dictionary created above
book_ratings = pd.DataFrame(dat)

# TO DO:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 
# 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4' 
# and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. 
# HINT: Use the `pandas.DataFrame.fillna(value, inplace = True)` function for substituting the NaN values. 
# Write your code below:
bb = book_ratings.fillna(np.mean(book_ratings, axis = 0), inplace = True)
bb

#best_rated = book_ratings[(book_ratings ==5).any(axis = 1)]['Book Title']
#best

C:\Users\sleem\AppData\Local\Temp\ipykernel_21880\3511452797.py:47: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  bb = book_ratings.fillna(book_ratings.mean(), inplace = True)